In [1]:
import pandas as pd

In [2]:
%run ../functions.ipynb

### Import data & model

In [3]:
#get sample dataset
# sub = pd.read_csv('../data/MDataFiles_Stage1/MSampleSubmissionStage1.csv') #first stage

sub = pd.read_csv('../data/MDataFiles_Stage2/MSampleSubmissionStage2.csv') #second stage
sub = process_sample_sub(sub)

In [4]:
sub = sub[['ID', 'Season', 'Team1', 'Team2']]

In [5]:
#processed data
all_games = pd.read_csv('../feature_engineering/output/all_games.csv')

In [6]:
#model
import pickle

# with open("../model_build/model/rf.pkl", "rb") as file: 
#     model = pickle.load(file)  
    
with open("../model_build/model/logreg.pkl", "rb") as file: 
     model = pickle.load(file)

### Prediction

In [7]:
all_games = all_games.fillna(0)

In [ ]:
pred_games = all_games[all_games.type == 1] # get only games not yet played


feature_list = ['seed_diff', 
            't1_adj_margin', 't2_adj_margin',
                't1_final_rank', 't2_final_rank',
                't1_OrdinalRank', 't2_OrdinalRank',
     't1_adj_margin_3',
 't2_adj_margin_3',
     't1_adj_margin_2',
 't2_adj_margin_2',
     't1_adj_margin_10',
 't2_adj_margin_10',
      't1_num_wins',
    't2_num_wins',
     't1_adj_margin_7',
 't2_adj_margin_7',
     't1_won_conf_tournament',
    't2_won_conf_tournament',
      't1_num_losses',
    't2_num_losses',
     't1_adj_margin_5',
 't2_adj_margin_5',
    'num_wins_diff',
]



X = pred_games[feature_list].values



pred_games['Pred'] = model.predict_proba(X)[:,1]

In [10]:
pred_games[['ID', 'Pred']].to_csv('submission.csv', index = False)

### Export Data For Bracket Simulator

In [10]:
pred_games.to_csv('all_predictions.csv', index = False)

In [11]:
teams = pd.read_csv(data_path + 'MTeams.csv')

NameError: name 'data_path' is not defined

In [ ]:
#Add team names
teams = pd.read_csv(data_path + 'MTeams.csv')
pred_games = pred_games.merge(teams[['TeamID', 'TeamName']], left_on = 'Team1', right_on = 'TeamID')
pred_games = pred_games.rename(columns = {'TeamName': 'Team1_name'})
pred_games = pred_games.merge(teams[['TeamID', 'TeamName']], left_on = 'Team2', right_on = 'TeamID')
pred_games = pred_games.rename(columns = {'TeamName': 'Team2_name'})

In [ ]:
import re 

data_path = '../data/MDataFiles_Stage2/' #this is for the second stage of data
slots = pd.read_csv(data_path + 'MNCAATourneySlots.csv')
tourney_seeds = pd.read_csv(data_path + 'MNCAATourneySeeds.csv')
teams = pd.read_csv(data_path + 'MTeams.csv')

# Add names
strong_seed = tourney_seeds.merge(teams[['TeamID', 'TeamName']], on = 'TeamID')
strong_seed = strong_seed.rename(columns = {'Seed': 'StrongSeed', 'TeamID': 'StrongSeedTeamID', 'TeamName': 'StrongSeedTeamName'})
weak_seed = tourney_seeds.merge(teams[['TeamID', 'TeamName']], on = 'TeamID')
weak_seed = weak_seed.rename(columns = {'Seed': 'WeakSeed', 'TeamID': 'WeakSeedTeamID', 'TeamName': 'WeekSeedTeamName'})

#Add seeds to slots
tourney_slots = slots.merge(strong_seed, how = 'left', on = ['Season', 'StrongSeed'])
tourney_slots = tourney_slots.merge(weak_seed, how = 'left', on = ['Season', 'WeakSeed'])
tourney_slots = tourney_slots[tourney_slots.Season == 2022]
tourney_slots['StrongSeedClean'] = tourney_slots['StrongSeed'].apply(lambda x: re.sub('[^0-9]','', x)).apply(int)
tourney_slots['WeakSeedClean'] = tourney_slots['WeakSeed'].apply(lambda x: re.sub('[^0-9]','', x)).apply(int)

# Add Round
tourney_slots['Round'] = tourney_slots['Slot'].apply(lambda x: 0 if x.startswith(('W', 'X', 'Y', 'Z')) else int(x[1]))
tourney_slots.sort_values(by = 'Round', inplace = True)

In [ ]:
prob_lookup = {}

for index, row in pred_games[['Team1', 'Team2', 'Pred']].iterrows():
    
    t1 = row['Team1']
    t2 = row['Team2']
    pred = row['Pred']
    
    if t1 in prob_lookup.keys():
        prob_lookup[t1][t2] = pred
        
    else:
        prob_lookup[t1] = {t2:pred}
    

    if t2 in prob_lookup.keys():
        prob_lookup[t2][t1] = 1 - pred
        
    else:
        prob_lookup[t2] = {t1: 1- pred}

#### Join with Team Names for exploration

In [12]:
data_path = '../data/MDataFiles_Stage2/' #this is for the second stage of data
teams = pd.read_csv(data_path + 'MTeams.csv')

In [13]:
pred_games = pred_games.merge(teams[['TeamID', 'TeamName']], left_on = 'Team1', right_on = 'TeamID')
pred_games = pred_games.rename(columns = {'TeamName': 'Team1_name'})
pred_games = pred_games.merge(teams[['TeamID', 'TeamName']], left_on = 'Team2', right_on = 'TeamID')
pred_games = pred_games.rename(columns = {'TeamName': 'Team2_name'})

In [14]:
pred_games.Team1_name = pred_games.Team1_name.str.lower()
pred_games.Team2_name = pred_games.Team2_name.str.lower()

#### Join with expert picks

In [15]:
data_path = '../data/' #this is for the second stage of data
experts = pd.read_csv(data_path + 'MExpertsMedianSubmission.csv')
experts.rename(columns = {'Pred': 'expert_pred'}, inplace = True)

In [16]:
pred_games = pred_games.merge(experts, how = 'left', on = ['ID'])

In [17]:
pred_games.head()

,Unnamed: 0,type,ID,Pred,Season,Team1,Team2,Outcome,Team1_conf,Team2_conf,...,t1_won_conf_tournament,num_wins_y,num_losses_y,ct_win_rate_y,t2_won_conf_tournament,TeamID_x,Team1_name,TeamID_y,Team2_name,expert_pred
0,2362,1,2022_1103_1104,0.274281,2022,1103,1104,0.0,mac,sec,...,1.0,0.0,1.0,0.0,0.0,1103,akron,1104,alabama,0.180029
1,2363,1,2022_1103_1112,0.150332,2022,1103,1112,0.0,mac,pac_twelve,...,1.0,3.0,0.0,1.0,1.0,1103,akron,1112,arizona,0.061795
2,2364,1,2022_1104_1112,0.318866,2022,1104,1112,0.0,sec,pac_twelve,...,0.0,3.0,0.0,1.0,1.0,1104,alabama,1112,arizona,0.241824
3,2365,1,2022_1103_1116,0.257818,2022,1103,1116,0.0,mac,sec,...,1.0,1.0,1.0,0.5,0.0,1103,akron,1116,arkansas,0.149892
4,2366,1,2022_1104_1116,0.478930,2022,1104,1116,0.0,sec,sec,...,0.0,1.0,1.0,0.5,0.0,1104,alabama,1116,arkansas,0.445409

In [18]:
def game_lookup(df, t1, t2, features = ['ID', 'Team1_name', 'Team2_name', 'Pred', 'expert_pred'], season = 2021):

    t1 = t1.lower()
    t2 = t2.lower()
    
    if t1 < t2:
        return df[ (df.Team1_name.str.startswith(t1)) & 
                         (df.Team2_name.str.startswith(t2)) ][features]
    else:
        return df[ (df.Team1_name.str.startswith(t2)) & 
                         (df.Team2_name.str.startswith(t1)) ][features]

In [35]:
game_lookup(pred_games, 'north c', 'kan')

                 ID Team1_name      Team2_name     Pred  expert_pred
766  2022_1242_1314     kansas  north carolina  0.70141     0.753885

In [123]:
test = myclass('yay')
list(test.__dict__.keys())

['first']

In [118]:
class myclass:
    def __init__(self, first):
        self.first = first

In [83]:
game_lookup(pred_games, 'verm', 'ark')

                  ID Team1_name Team2_name      Pred
1833  2022_1116_1436   arkansas    vermont  0.560159

In [17]:
game_lookup(pred_games, 'hous', 'uab')

                  ID Team1_name Team2_name      Pred
1672  2022_1222_1412    houston        uab  0.716046

In [18]:
game_lookup(pred_games, 'rich', 'iowa')

                 ID Team1_name Team2_name      Pred
968  2022_1234_1350       iowa   richmond  0.592715
969  2022_1235_1350    iowa st   richmond  0.501814

In [19]:
game_lookup(pred_games, 's dak', 'prov')

                  ID  Team1_name   Team2_name      Pred
1077  2022_1344_1355  providence  s dakota st  0.568186

In [20]:
game_lookup(pred_games, 'bois', 'mem')

                 ID Team1_name Team2_name     Pred
471  2022_1129_1272   boise st    memphis  0.39301

In [21]:
game_lookup(pred_games, 'mich', 'david')

                 ID Team1_name   Team2_name      Pred
542  2022_1172_1276   davidson     michigan  0.418045
575  2022_1172_1277   davidson  michigan st  0.490400

In [22]:
game_lookup(pred_games, 'north', 'marq')

                 ID Team1_name      Team2_name      Pred
771  2022_1266_1314  marquette  north carolina  0.463366

In [23]:
game_lookup(pred_games, 'texas', 'virg')

                  ID  Team1_name     Team2_name      Pred
2008  2022_1400_1439       texas  virginia tech  0.599843
2009  2022_1403_1439  texas tech  virginia tech  0.561910

In [24]:
game_lookup(pred_games, 'murr', 'san f')

                  ID Team1_name     Team2_name      Pred
1164  2022_1293_1362  murray st  san francisco  0.504721

In [25]:
game_lookup(pred_games, 'set', 'tcu')

                  ID  Team1_name Team2_name      Pred
1427  2022_1371_1395  seton hall        tcu  0.515771

In [26]:
game_lookup(pred_games, 'colorado st', 'mich')

                 ID   Team1_name   Team2_name      Pred
538  2022_1161_1276  colorado st     michigan  0.412399
571  2022_1161_1277  colorado st  michigan st  0.484590

In [27]:
game_lookup(pred_games, 'ohio st', 'loy')

                 ID      Team1_name Team2_name      Pred
848  2022_1260_1326  loyola-chicago    ohio st  0.502067

In [28]:
game_lookup(pred_games, 'san diego st', 'creig')

                  ID Team1_name    Team2_name      Pred
1093  2022_1166_1361  creighton  san diego st  0.447932

In [29]:
game_lookup(pred_games, 'lsu', 'iowa st')

                 ID Team1_name Team2_name      Pred
429  2022_1235_1261    iowa st        lsu  0.433582

In [30]:
game_lookup(pred_games, 'lsu', 'wisc')

                  ID Team1_name Team2_name      Pred
2045  2022_1261_1458        lsu  wisconsin  0.515979

In [31]:
game_lookup(pred_games, 'usc', 'mia')

                  ID Team1_name Team2_name      Pred
1802  2022_1274_1425   miami fl        usc  0.471832

In [32]:
game_lookup(pred_games, 'colg', 'wisc')

                  ID Team1_name Team2_name      Pred
2025  2022_1159_1458    colgate  wisconsin  0.422647

In [33]:
game_lookup(pred_games, 'ind', 'st')

                  ID Team1_name    Team2_name      Pred
1246  2022_1231_1388    indiana  st mary's ca  0.473595
1296  2022_1231_1389    indiana    st peter's  0.608436

In [37]:
game_lookup(pred_games, 'gonz', 'ariz')

                 ID Team1_name Team2_name      Pred
155  2022_1112_1211    arizona    gonzaga  0.312694

In [102]:
game_lookup(pred_games, 's d', 'prov')

0.13045098508

In [104]:
.65 * .62

0.403

In [143]:
twelve_five

                  ID     Team1_name     Team2_name      Pred
221   2022_1163_1231    connecticut        indiana  0.502792
229   2022_1222_1231        houston        indiana  0.700963
252   2022_1231_1234        indiana           iowa  0.450276
677   2022_1163_1308    connecticut  new mexico st  0.647214
685   2022_1222_1308        houston  new mexico st  0.809620
688   2022_1234_1308           iowa  new mexico st  0.688948
957   2022_1163_1350    connecticut       richmond  0.573284
965   2022_1222_1350        houston       richmond  0.756942
968   2022_1234_1350           iowa       richmond  0.618610
1246  2022_1231_1388        indiana   st mary's ca  0.466935
1262  2022_1308_1388  new mexico st   st mary's ca  0.325611
1269  2022_1350_1388       richmond   st mary's ca  0.397343
1664  2022_1163_1412    connecticut            uab  0.532001
1672  2022_1222_1412        houston            uab  0.724901
1675  2022_1234_1412           iowa            uab  0.578488
1703  2022_1388_1412   st mary's ca            uab  0.562045
2156  2022_1163_1461    connecticut        wyoming  0.542226
2164  2022_1222_1461        houston        wyoming  0.733026
2167  2022_1234_1461           iowa        wyoming  0.588483
2195  2022_1388_1461   st mary's ca        wyoming  0.572142

In [38]:
fourteen_three = pred_games[
                ((pred_games.t1_Seed == 3) & (pred_games.t2_Seed == 14) 
                 | (pred_games.t1_Seed == 14) & (pred_games.t2_Seed == 3)) 
                          & (pred_games.Season == 2022) 
                          ][['ID', 'Team1_name', 'Team2_name', 'Pred']]

In [39]:
thirteen_four = pred_games[
                ((pred_games.t1_Seed == 13) & (pred_games.t2_Seed == 4) 
                 | (pred_games.t1_Seed == 4) & (pred_games.t2_Seed == 13)) 
                          & (pred_games.Season == 2022) 
                          ][['ID', 'Team1_name', 'Team2_name', 'Pred']]

In [40]:
twelve_five = pred_games[
                ((pred_games.t1_Seed == 12) & (pred_games.t2_Seed == 5) 
                 | (pred_games.t1_Seed == 5) & (pred_games.t2_Seed == 12)) 
                          & (pred_games.Season == 2022) 
                          ][['ID', 'Team1_name', 'Team2_name', 'Pred']]

In [41]:
eleven_six = pred_games[
                ((pred_games.t1_Seed == 11) & (pred_games.t2_Seed == 6) 
                 | (pred_games.t1_Seed == 6) & (pred_games.t2_Seed == 11)) 
                          & (pred_games.Season == 2022) 
                          ][['ID', 'Team1_name', 'Team2_name', 'Pred']]

In [42]:
ten_seven = pred_games[
                ((pred_games.t1_Seed == 10) & (pred_games.t2_Seed == 7) 
                 | (pred_games.t1_Seed == 7) & (pred_games.t2_Seed == 10)) 
                          & (pred_games.Season == 2022) 
                          ][['ID', 'Team1_name', 'Team2_name', 'Pred']]

In [46]:
twelve_five

                  ID     Team1_name     Team2_name      Pred
221   2022_1163_1231    connecticut        indiana  0.504123
229   2022_1222_1231        houston        indiana  0.698853
252   2022_1231_1234        indiana           iowa  0.454844
677   2022_1163_1308    connecticut  new mexico st  0.565442
685   2022_1222_1308        houston  new mexico st  0.748123
688   2022_1234_1308           iowa  new mexico st  0.605372
957   2022_1163_1350    connecticut       richmond  0.552451
965   2022_1222_1350        houston       richmond  0.738064
968   2022_1234_1350           iowa       richmond  0.592715
1246  2022_1231_1388        indiana   st mary's ca  0.473595
1262  2022_1308_1388  new mexico st   st mary's ca  0.412776
1269  2022_1350_1388       richmond   st mary's ca  0.425605
1664  2022_1163_1412    connecticut            uab  0.524875
1672  2022_1222_1412        houston            uab  0.716046
1675  2022_1234_1412           iowa            uab  0.565670
1703  2022_1388_1412   st mary's ca            uab  0.547062
2156  2022_1163_1461    connecticut        wyoming  0.552368
2164  2022_1222_1461        houston        wyoming  0.737999
2167  2022_1234_1461           iowa        wyoming  0.592634
2195  2022_1388_1461   st mary's ca        wyoming  0.574313

In [339]:
fourteen_three['Pred2'] = 1 - fourteen_three['Pred']

In [333]:
fourteen_three['Pred'].mean()

0.1650013922867077

In [340]:
fourteen_three['Pred2'].mean()

0.16501969892436016

In [69]:
game_lookup(all_games, 'gonz', 'mem', season = 2021)

AttributeError: 'DataFrame' object has no attribute 'Team1_name'

In [304]:
game_lookup(all_games, 'florida st', 'vermont', season = 2019)

                  ID  Team1_name Team2_name      Pred
3408  2019_1199_1436  florida st    vermont  0.814959

In [305]:
game_lookup(all_games, 'Kansas St', 'Uc irvine', season = 2019)

                  ID Team1_name Team2_name      Pred
4373  2019_1243_1414  kansas st  uc irvine  0.780656

In [306]:
game_lookup(all_games, 'Kansas', 'northeastern', season = 2019)

                  ID Team1_name    Team2_name      Pred
4322  2019_1242_1318     kansas  northeastern  0.815838

In [309]:
game_lookup(all_games, 'Arizona', 'buffalo', season = 2018)

                  ID  Team1_name Team2_name     Pred
3647  2018_1112_1138     arizona    buffalo  0.76695
3648  2019_1113_1138  arizona st    buffalo  0.28204

In [318]:
game_lookup(all_games, 'gonzaga', 'u', season = 2018)

                  ID Team1_name        Team2_name      Pred
217   2006_1211_1417    gonzaga              ucla  0.433957
218   2015_1211_1417    gonzaga              ucla  0.838355
219   2021_1211_1417    gonzaga              ucla  0.911394
2296  2021_1211_1364    gonzaga  uc santa barbara  0.938073
2689  2018_1211_1422    gonzaga    unc greensboro  0.862989
2690  2021_1211_1422    gonzaga    unc greensboro  0.961901
2747  2021_1211_1425    gonzaga               usc  0.822869
2817  2021_1211_1429    gonzaga           utah st  0.919718
3450  2016_1211_1428    gonzaga              utah  0.575548

In [ ]:
game_lookup(all_games, 'gonzaga', 'u', season = 2018)

In [ ]:
# 23, 12, 15, 14 -- 2018
# 13, 19, 22, 19 -- 2019
#19, 21, 28, 25 -- 2021

In [319]:
(23 + 12 + 15 + 14) / 4

16.0

In [307]:
(13 + 19 + 22 + 19) / 4

18.25

In [308]:
(19 + 21 + 28 + 25) / 4

23.25

In [342]:
#15 - 2

pd.concat([game_lookup(all_games, 'ohio st', 'oral'), 
           game_lookup(all_games, 'hou', 'clev'),
          game_lookup(all_games, 'alabama', 'iona'),
          game_lookup(all_games, 'iowa', 'grand')
          ])

                  ID    Team1_name    Team2_name      Pred
1971  2021_1326_1331       ohio st  oral roberts  0.907590
906   2021_1156_1222  cleveland st       houston  0.043788
958   2021_1104_1233       alabama          iona  0.921044
1021  2021_1213_1234  grand canyon          iowa  0.091959

In [341]:
#14 - 3

pd.concat([game_lookup(all_games, 'we', 'mo'), 
           game_lookup(all_games, 'e w', 'ka'),
          game_lookup(all_games, 'ark', 'colg'),
          game_lookup(all_games, 'texas', 'abile')
          ])

                  ID    Team1_name     Team2_name      Pred
3113  2021_1287_1452   morehead st  west virginia  0.176077
3114  2010_1288_1452     morgan st  west virginia  0.061838
1057  2021_1186_1242  e washington         kansas  0.168621
567   2021_1116_1159      arkansas        colgate  0.464988
2544  2021_1101_1400   abilene chr          texas  0.313014
2615  2021_1101_1403   abilene chr     texas tech  0.323417

In [ ]:
# 17, 17, 31, 54

In [270]:
#13 - 4

pd.concat([game_lookup(all_games, 'virg', 'ohio'), 
           game_lookup(all_games, 'unc g', 'florida s'),
          game_lookup(all_games, 'north tex', 'pur'),
          game_lookup(all_games, 'oklahoma s', 'lib')
          ])

                  ID   Team1_name      Team2_name      Pred
1930  2021_1325_1438         ohio        virginia  0.194837
1931  2021_1326_1438      ohio st        virginia  0.565400
1992  2021_1325_1439         ohio   virginia tech  0.318271
1993  2021_1326_1439      ohio st   virginia tech  0.715095
1612  2021_1199_1422   florida st  unc greensboro  0.797556
1073  2021_1317_1345  north texas          purdue  0.283391
888   2021_1251_1329      liberty     oklahoma st  0.250539

In [260]:
#12 - 5
pd.concat([game_lookup(all_games, 'uc santa', 'cre'), 
           game_lookup(all_games, 'color', 'georgeto'),
          game_lookup(all_games, 'tenn', 'oregon st'),
          game_lookup(all_games, 'villa', 'wint')])

                  ID Team1_name        Team2_name      Pred
1187  2021_1166_1364  creighton  uc santa barbara  0.737243
145   2021_1160_1207   colorado        georgetown  0.763195
1371  2021_1333_1397  oregon st         tennessee  0.221124
2206  2021_1437_1457  villanova          winthrop  0.794843

In [266]:
#11 - 6

pd.concat([game_lookup(all_games, 'usc', 'drake'), 
           game_lookup(all_games, 'usc', 'wich'),
          game_lookup(all_games, 'syra', 'san die'),
          game_lookup(all_games, 'texas t', 'utah s'),
           game_lookup(all_games, 'byu', 'michigan s'),
            game_lookup(all_games, 'byu', 'ucla'),
          ])

                  ID    Team1_name   Team2_name      Pred
1665  2021_1179_1425         drake          usc  0.226869
2138  2021_1425_1455           usc   wichita st  0.818239
1323  2021_1361_1393  san diego st     syracuse  0.711787
1765  2021_1403_1429    texas tech      utah st  0.608665
501   2021_1140_1277           byu  michigan st  0.724025
1545  2021_1140_1417           byu         ucla  0.628415

In [263]:
#10 - 7

pd.concat([game_lookup(all_games, 'orego', 'vcu'), 
           game_lookup(all_games, 'conn', 'mary'),
          game_lookup(all_games, 'clem', 'rutg'),
          game_lookup(all_games, 'florida', 'virginia t')])

                  ID   Team1_name     Team2_name      Pred
1814  2021_1332_1433       oregon            vcu  0.588257
1815  2021_1333_1433    oregon st            vcu  0.351475
445   2021_1163_1268  connecticut       maryland  0.605717
1087  2021_1155_1353      clemson        rutgers  0.500835
1968  2021_1196_1439      florida  virginia tech  0.515983
1969  2021_1199_1439   florida st  virginia tech  0.651138

In [264]:
# 9 - 8
pd.concat([game_lookup(all_games, 'oklah', 'missour'), 
           game_lookup(all_games, 'lsu', 'st b'),
          game_lookup(all_games, 'north c', 'wiscon'),
          game_lookup(all_games, 'loyola', 'georgia t')])

                  ID      Team1_name      Team2_name      Pred
853   2021_1281_1328        missouri        oklahoma  0.493813
894   2021_1281_1329        missouri     oklahoma st  0.409455
1254  2021_1261_1382             lsu  st bonaventure  0.492229
2248  2021_1314_1458  north carolina       wisconsin  0.433576
396   2021_1210_1260    georgia tech  loyola-chicago  0.409407

In [412]:
game_lookup(all_games, 'syracuse', 'west')

                  ID Team1_name     Team2_name      Pred
2067  2021_1393_1452   syracuse  west virginia  0.314791

                  ID   Team1_name  Team2_name      Pred
1378  2021_1101_1400  abilene chr       texas  0.313014
1431  2021_1101_1403  abilene chr  texas tech  0.323417

In [78]:
all_games[ (all_games.Team1_name.str.contains('Georg')) & (all_games.Team2_name.str.contains('Loyola')) ]

,Unnamed: 0,type,ID,Pred,Season,Team1,Team2,Outcome,avg_rank_x,t1_final_rank,...,t1_adj_oe_0,t1_adj_de_0,t2_adj_oe_0,t2_adj_de_0,t1_adj_margin,t2_adj_margin,TeamID_x,Team1_name,TeamID_y,Team2_name
395,3243,1,2021_1207_1260,0.284340,2021,1207,1260,0.0,51,81.876843,...,104.980543,98.533603,113.798182,89.56814,6.446940,24.230042,1207,Georgetown,1260,Loyola-Chicago
396,3292,1,2021_1210_1260,0.409407,2021,1210,1260,0.0,36,83.919965,...,116.173329,100.111888,113.798182,89.56814,16.061441,24.230042,1210,Georgia Tech,1260,Loyola-Chicago

In [56]:
teams[teams['TeamName'].str.contains('Georg')]

     TeamID      TeamName  FirstD1Season  LastD1Season
105    1206  George Mason           1985          2021
106    1207    Georgetown           1985          2021
107    1208       Georgia           1985          2021
108    1209    Georgia St           1985          2021
109    1210  Georgia Tech           1985          2021

In [15]:

teams.head()

   TeamID     TeamName  FirstD1Season  LastD1Season
0    1101  Abilene Chr           2014          2021
1    1102    Air Force           1985          2021
2    1103        Akron           1985          2021
3    1104      Alabama           1985          2021
4    1105  Alabama A&M           2000          2021